ConditionId = {
    special = {
        -- 特定条件校验
        ["使用经验药水"] = 2101,
        ["跑环刷新"] = 2701,
    },
    level = {
        ["等级>"] = 100,
        ["等级>="] = 101,
        ["等级=="] = 102,
        ["等级<="] = 103,
        ["等级<"] = 104,
        ["等级~="] = 105,
    },
    rehcarge = {
        ["充值总金额>"] = 206,
        ["充值总金额>="] = 207,
        ["充值总金额=="] = 208,
        ["充值总金额<="] = 209,
        ["充值总金额<"] = 210,
        ["充值总金额~="] = 211,
    },
    openDay = {
        ["开服天数>"] = 900,
        ["开服天数>="] = 901,
        ["开服天数=="] = 902,
        ["开服天数<="] = 903,
        ["开服天数<"] = 904,
        ["开服天数~="] = 905,
    },
    equip = {
        ["穿戴某装备"] = 1010
    },
    buff = {
        ["存在某buff"] = 1101,
    },
    vip = {
        ["vip等级"] = 1201,
    },
    gift = {
        ["购买过特惠礼包"] = 1301,
    },
    privilege = {
        ["拥有某项特权卡"] = 2102,
        ["拥有某项特权"] = 2103,
    },
    active = {
        ["真实时间检测"] = 971,
        ["主活动持续时间检测"] = 980,
        ["子活动持续时间检测"] = 981,
        ["检测为几周"] = 991,
    },
    crossServer = {
        ["跨服天数>"] = 2300,
        ["跨服天数>="] = 2301,
        ["跨服天数=="] = 2302,
        ["跨服天数<="] = 2303,
        ["跨服天数<"] = 2304,
        ["跨服天数~="] = 2305,
    },
    combineServer = {
        ["合服天数>"] = 2400,
        ["合服天数>="] = 2401,
        ["合服天数=="] = 2402,
        ["合服天数<="] = 2403,
        ["合服天数<"] = 2404,
        ["合服天数~="] = 2405,
    },
    union = {
        ["加入战盟分钟>"] = 2500,
        ["加入战盟分钟>="] = 2501,
        ["加入战盟分钟=="] = 2502,
        ["加入战盟分钟<="] = 2503,
        ["加入战盟分钟<"] = 2504,
        ["加入战盟分钟~="] = 2505,
    },
    activity = {
        ["活动是否开启"] = 2600,
    },
    task = {
        ["拥有已接取任务"] = 2700,
    },
}
