-- 此文件工具自动生成，不要修改
---@class cfg_synthesisRateGroup_column
---@field id number @id column=1 A
---根据装备的强化等级区间增加合成基础成功率
---配置格式：最小强化等级#最大强化等级#增加的成功率（万分比）
---@field strengthenRate IntListList @强化等级增加成功率 column=2 B
---根据装备的追加等级区间增加合成基础成功率
---配置格式：最小追加等级#最大追加等级#增加的成功率（万分比）
---@field appendsRate IntListList @追加等级增加成功率 column=3 C
---根据装备带有属性区间增加合成基础成功率
---配置格式：属性id#最小属性值#最大属性值#增加的成功率（万分比）
---@field attRate IntListList @属性增加成功率 column=4 D

local local_strengthenRate = {
    strengthenRate_1={{10,10,500},{11,11,1000},{12,12,1500},{13,13,2000},{14,14,2500},{15,15,3000}},

}

local local_appendsRate = {
    appendsRate_1={{1,1,100},{2,2,200},{3,3,300},{4,4,400},{5,5,500},{6,6,600},{7,7,700},{8,8,800},{9,9,900},{10,10,1000},{11,11,1100},{12,12,1200},{13,13,1300},{14,14,1400},{15,15,1500},{16,16,1600},{17,17,1700},{18,18,1800},{19,19,1900},{20,20,2000}},
    appendsRate_2={{5,5,500},{6,6,1000},{7,7,1500},{8,8,2000},{9,9,2500},{10,10,3000},{11,11,3500},{12,12,4000},{13,13,4500},{14,14,5000},{15,15,5500},{16,16,6000},{17,17,6500},{18,18,7000},{19,19,7500},{20,20,8000}},
    appendsRate_3={},

}

local local_attRate = {
    attRate_1={},

}

local cfg_synthesisRateGroup =
{
	{id=2, strengthenRate={{5,5,500},{6,6,1000},{7,7,1500},{8,8,2000},{9,9,2500},{10,10,3000},{11,11,3500},{12,12,4000},{13,13,4500},{14,14,5000},{15,15,5500}}, appendsRate=local_appendsRate.appendsRate_1, attRate={{326012,1,10000,1000}}},
	{id=3, strengthenRate={{1,5,1000},{6,6,2000},{7,7,3000},{8,8,4000},{9,9,5000},{10,10,6000},{11,11,7000},{12,12,8000},{13,13,9000}}, appendsRate=local_appendsRate.appendsRate_1, attRate={{326012,1,10000,500}}},
	{id=4},
	{id=5, strengthenRate={{14,14,500},{15,15,1000}}},
	{id=6, strengthenRate={{8,8,500},{9,9,1000},{10,10,1500},{11,11,2000},{12,12,2500},{13,13,3000},{14,14,3500},{15,15,4000}}},
	{id=7, strengthenRate={{6,6,1000},{7,7,2000},{8,8,3000},{9,9,4000},{10,10,5000},{11,11,6000},{12,12,7000},{13,13,8000},{14,14,8500},{15,15,9000}}, appendsRate=local_appendsRate.appendsRate_3},
	{id=8, appendsRate=local_appendsRate.appendsRate_3},
	{id=9, strengthenRate={{11,12,3000},{13,14,5000},{15,99,6000}}, appendsRate=local_appendsRate.appendsRate_3},
}

local defaults = {strengthenRate={{10,10,500},{11,11,1000},{12,12,1500},{13,13,2000},{14,14,2500},{15,15,3000}}, appendsRate={{5,5,500},{6,6,1000},{7,7,1500},{8,8,2000},{9,9,2500},{10,10,3000},{11,11,3500},{12,12,4000},{13,13,4500},{14,14,5000},{15,15,5500},{16,16,6000},{17,17,6500},{18,18,7000},{19,19,7500},{20,20,8000}}, attRate={}}
local mt = {__index = defaults}
for _, v in ipairs(cfg_synthesisRateGroup) do
	setmetatable(v, mt)
end

return cfg_synthesisRateGroup