-- 此文件工具自动生成，不要修改
---@class cfg_repGlobal_column
---每个id程序单独写死
---@field id number @id column=1 A
---目前仅策划使用
---@field type string @分类标记 column=2 B
---参数为对应内容参数
---@field value string @参数 column=3 C
---该项的功能说明
---@field remarks string @说明 column=4 D
---对应副本类型
---@field repID number @对应副本类型 column=5 E
local cfg_repGlobal =
{
	{id=10001001, type="恶魔广场&血色城堡", value="5", remarks="副本内匹配人数上限", repID=10001},
	{id=10001002, type="恶魔广场&血色城堡", value="30", remarks="剩余X秒可跳过准备阶段时间", repID=10001},
	{id=10001003, type="恶魔广场", value="1#1#4320|2#1#12240|3#1#26040|4#1#55560|5#1#105600|6#1#211800|7#1#381000", remarks="怪物积分，格式：副本等级#积分#积分经验|副本等级#积分#积分经验", repID=10001},
	{id=10001005, type="恶魔广场", value="2#50010008#1#1", repID=10001},
	{id=10001006, type="恶魔广场&血色城堡", value="2#500|3#1000|4#1500|5#2000", remarks="组队经验加成。人数#经验加成", repID=10001},
	{id=11001001, type="血色城堡", value="101201", remarks="进入副本后，刷新npc，填npc ID", repID=11001},
	{id=11001002, type="血色城堡", value="12#69|13#69|14#69|15#69|16#69", remarks="阶段1 阻挡范围   x#y|x#y|x#y", repID=11001},
	{id=11001003, type="血色城堡", value="1#11001007#14#76|2#11002007#14#76|3#11003007#14#76|4#11004007#14#76|5#11005007#14#76|6#11006007#14#76|7#11007007#14#76|8#11008007#14#76|9#11009007#14#76|10#11010007#14#76", remarks="阶段1 刷新城门怪  格式：副本等级#怪物ID#怪物坐标", repID=11001},
	{id=11001004, type="血色城堡", value="12#76|13#76|14#76|15#76|16#76", remarks="阶段2 城门阻挡范围   x#y|x#y|x#y", repID=11001},
	{id=11001005, type="血色城堡", value="1#11001008#14#95|2#11002008#14#95|3#11003008#14#95|4#11004008#14#95|5#11005008#14#95|6#11006008#14#95|7#11007008#14#95|8#11008008#14#95|9#11009008#14#95|10#11010008#14#95", remarks="阶段4刷新灵柩怪  格式：副本等级#怪物ID#怪物坐标", repID=11001},
	{id=11001006, type="血色城堡", value="2#50010009#1#1", repID=11001},
	{id=11001007, type="血色城堡", value="13#14|14#14|15#14", remarks="准备阶段 阻挡范围   x#y|x#y|x#y", repID=11001},
	{id=12001001, type="勇气试炼", value="12001#12100", remarks="勇气试炼第一层&最后一层", repID=12001},
	{id=12001002, type="勇气试炼", value="100#21600003#1", remarks="勇气试炼阶段大奖。层数#道具id#道具数量", repID=12001},
	{id=12001003, type="勇气试炼", value="100#100creward", remarks="勇气试炼阶段大奖。层数#图片名|层数#图片名", repID=12001},
	{id=14001001, type="战盟BOSS", value="2", remarks="前N个通关的战盟获得拍卖奖励", repID=14001},
	{id=14001002, type="战盟BOSS", value="2000", remarks="战盟分红比例，单位：万比", repID=14001},
	{id=14001003, type="战盟BOSS", value="1#101301|2#101302|3#101303|4#101304", remarks="层级#传送点位置；注意层级数量需与任务数量（cfg_repTask）对应；最后一层不存在传送点", repID=14001},
	{id=14001004, type="战盟BOSS", value="10090001#1000", remarks="战盟奖励，每击杀一只BOSS战盟获取对应奖励；格式：道具ID#数量；仅支持配置战盟资源道具", repID=14001},
	{id=15001001, type="狼魂要塞", value="15001", remarks="狼魂要塞副本ID", repID=15001},
	{id=15001002, type="狼魂要塞", value="100000", remarks="狼魂要塞，怪物初始对狼神台的仇恨", repID=15001},
	{id=16001001, value="4#20#0", remarks="攻城战 额外开的场次 开服第X天开启 配置天数 # 小时 #分"},
	{id=16001002, value="1", remarks="战盟人数不足X人时将自动取消活动资格"},
	{id=16001003, value="86#48#3|95#221#3", remarks="攻城战 攻方传送点#范围|守方传送点#范围"},
	{id=16001004, value="72#120#39#57|90#100#218#224", remarks="攻城战准备区  攻方|守方"},
	{id=16001005, value="16001001#16001101", remarks="攻城战任务  攻方#守方 reptask表ID"},
	{id=16001006, value="100", remarks="攻城战 玩家使用范围型技能时，对地方造成X%的伤害。技能目标>1"},
	{id=16001007, value="95#221", remarks="攻城战守方复活点"},
	{id=16001008, value="16001001#86#48|16001002#95#147|16001003#93#189|16001004#95#221", remarks="攻城战攻方复活点，随阶段推进，修改复活点. 攻方任务ID#x#y|攻方任务ID#x#y"},
	{id=16001009, remarks="攻城战不可进入区 建筑怪坐标#不可进入区|建筑怪坐标#不可进入区"},
	{id=16001010, value="46004#46005#46006#46007|55", remarks="攻城战守护石像怪击杀后，传送门才可生效。怪1#怪2#怪3#怪4|传送门 mapMove ID"},
	{id=16001011, value="Effect/Skill/Eff_yujing_yuan_qiji4.prefab|176.5#0.6#204.5#1.6", remarks="龙之塔占领区 区域"},
	{id=16001012, value="30", remarks="读条时间"},
	{id=16001013, value="176.5#204.5#5", remarks="龙之塔占领区 中心点#范围"},
	{id=16001014, value="", remarks="排名区间&奖励道具#数量&奖励道具#数量|排名区间&奖励道具#数量&奖励道具#数量"},
	{id=16001015, value="21500004#1|10240001#10000", remarks="胜利方盟主奖励"},
	{id=16001016, value="", remarks="胜利方战盟成员奖励"},
	{id=16001017, value="", remarks="失败方战盟成员奖励"},
	{id=16001018, value="1#10#6000#60", remarks="攻城方得分：单次攻击建筑得分#击杀玩家积分#获得1点积分所需要造成的伤害/治疗量（累计）#成功占领罗兰之冠所获得的积分"},
	{id=16001019, value="10#6000#1", remarks="守城方得分：击杀玩家积分#获得1点积分所需要造成的伤害/治疗量（累计）#第8阶段后，每在罗兰之冠出停留时间达到X秒，获得1分"},
	{id=16001020, value="300", remarks="活动奖励领取需求最低个人积分"},
	{id=16001021, value="16001004#16001104", remarks="进入龙之塔的阶段（repTask ID，攻#防)"},
	{id=16001022, value="1", remarks="单次攻击建筑得分"},
	{id=16001023, value="10", remarks="击杀玩家积分"},
	{id=16001024, value="6000", remarks="获得1点积分所需要造成的伤害"},
	{id=16001025, value="60", remarks="成功占领罗兰之冠所获得的积分"},
	{id=16001026, value="1", remarks="第8阶段后，每在罗兰之冠出停留时间达到X秒，获得1分"},
	{id=17001001, type="赤色要塞", value="17001#17002#17003#17004#17005#17006", remarks="玩法规则：赤色要塞副本ID", repID=17001},
	{id=18001001, type="特权BOSS", value="1", remarks="黄金特权玩家每日额外恢复1次挑战次数；", repID=18001},
	{id=18001002, type="特权BOSS", value="2", remarks="钻石特权玩家每日额外恢复2次挑战次数；", repID=18001},
	{id=18001003, type="特权BOSS", value="1", remarks="开启后免费获得的挑战次数；", repID=18001},
	{id=19001001, type="大秘境", value="50010011", remarks="大秘境钥匙itemID", repID=19001},
	{id=19001002, type="大秘境", value="10", remarks="通关后，钥匙默认升级时间，单位秒。", repID=19001},
	{id=19001003, type="大秘境", value="3#3", remarks="每日增加得奖励次数#奖励次数上限", repID=19001},
	{id=19001004, type="大秘境", value="10", remarks="通关后，奖励默认不领取时间，单位秒。", repID=19001},
	{id=19001005, type="大秘境", value="1#0", remarks="大秘境挑战刷新时间：1#X，每天X点刷新；2#X，每周一早上X点刷新", repID=19001},
	{id=19001006, type="大秘境", value="S", remarks="大秘境开启扫荡条件。", repID=19001},
	{id=21001001, type="昆顿入侵", value="1#100", remarks="对昆顿造成伤害与获得积分比例。昆顿血量万分比#积分数", repID=21001},
	{id=21001002, type="昆顿入侵", value="2000", remarks="掠夺被击杀玩家积分比例。万分比", repID=21001},
	{id=21001003, type="昆顿入侵", value="1#1#10200001#100#50030001#10#50030002#10#50030004#10|2#10#10200001#90#50030001#9#50030002#9#50030004#9", remarks="个人排名奖励。格式：最高排名#最低排名#道具1id#道具1数量#道具2id#道具2数量#道具3id#道具3数量#道具4id#道具4数量。最高排名和最低排名相同时就不显示区间，只显示这个排名", repID=21001},
	{id=21001004, type="昆顿入侵", value="2000", remarks="拍卖分红手续费比例。万分比", repID=21001},
	{id=21001005, type="昆顿入侵", value="21600006", remarks="稀有道具id。", repID=21001},
	{id=21001006, type="昆顿入侵", value="100", remarks="上榜最低积分", repID=21001},
	{id=21001007, type="昆顿入侵", value="3", remarks="当前积分榜刷新频率（秒）", repID=21001},
	{id=21001008, type="昆顿入侵", value="巨龙#猎鹰#苍狼", remarks="阵营名称#阵营名称#阵营名称", repID=21001},
	{id=27001001, type="咒怨魔王", value="10", remarks="进入二阶段倒计时", repID=27001},
	{id=27000001, type="卡利玛神庙", value="10", remarks="卡利玛神庙扫荡次数，配置格式：整数", repID=20001},
}

local defaults = {type="攻城战", value="67#114#66#114#66#115#67#115#68#114#68#115#69#114|93#114#92#114#92#115#93#115#94#114#94#115#95#114|119#114#118#114#118#115#119#115#120#114#120#115#121#114|107#161#106#161#106#162#107#162#108#161#108#162#109#161|81#161#80#161#80#162#81#162#82#161#82#162#83#161|93#204#92#204#92#205#93#205#94#204#94#205#95#204", remarks="奖励多倍领取，格式：X倍领取#消耗道具#数量#额外消耗次数#等级限制|X倍领取#消耗道具#数量#额外消耗次数#等级限制|X倍领取#消耗道具#数量#额外消耗次数#等级限制", repID=16001}
local mt = {__index = defaults}
for _, v in ipairs(cfg_repGlobal) do
	setmetatable(v, mt)
end

return cfg_repGlobal